{
    "Apple-Apple scab": {
        "disease": "scab",
        "treatment": "<p>O sintoma de 'scab' em plantas ocorre devido a deficiência de nutrientes, particularmente a deficiência de cálcio. Quando uma planta apresenta scab, você pode perceber manchas escuras e ásperas nas folhas, que podem se espalhar para os frutos, causando danos significativos. Para tratar esse sintoma e corrigir a deficiência de cálcio, você pode seguir estas etapas simples:</p><ol><li><strong>Calcário de conchas:</strong> Adicionar calcário moído de conchas ao solo pode aumentar o pH e a disponibilidade de cálcio para as plantas.</li><li><strong>Adubo rico em cálcio:</strong> Utilize um adubo rico em cálcio para fornecer o nutriente necessário para as plantas, promovendo um crescimento saudável.</li><li><strong>Regar regularmente:</strong> Mantenha a umidade no solo constante, mas evite o encharcamento, pois o excesso de água pode dificultar a absorção de cálcio pelas plantas.</li><li><strong>Poda de frutos afetados:</strong> Remova os frutos afetados pelo scab para evitar a propagação da condição e permitir que a planta redirecione seus recursos para frutos saudáveis.</li></ol><p>Seguindo estas etapas, você pode ajudar suas plantas a superar a deficiência de cálcio e prevenir o sintoma de scab, promovendo um crescimento saudável e frutos de melhor qualidade.</p>"
    },
    "Apple-Black rot": {
        "disease": "Podridão negra",
            "treatment": "<p>Se a sua planta doméstica está mostrando sintomas de podridão negra ou deficiência de nutrientes, é importante agir rapidamente para restaurar sua saúde. A podridão negra é uma doença causada por um fungo que pode afetar muitas plantas, causando manchas escuras nas folhas e podridão no tecido vegetal. Para tratar essa condição e outras deficiências de nutrientes, siga estas etapas simples:</p><ol><li><strong>Isolamento:</strong> Se a doença estiver afetando apenas algumas partes da planta, remova as áreas afetadas e descarte-as para evitar a propagação da doença. Se possível, isole a planta do restante do seu jardim para prevenir a contaminação de outras plantas.</li><li><strong>Higienização:</strong> Limpe qualquer ferramenta de jardinagem ou superfície que tenha entrado em contato com a planta doente para evitar a disseminação da doença. Use desinfetantes suaves para limpar tesouras de poda, vasos e outras ferramentas.</li><li><strong>Nutrição:</strong> Certifique-se de que a planta esteja recebendo todos os nutrientes necessários para manter sua saúde. Se suspeitar de deficiências nutricionais, considere a adição de um fertilizante equilibrado rico em micronutrientes para promover o crescimento saudável. Verifique se a planta está recebendo a quantidade adequada de água e luz solar.</li><li><strong>Manutenção:</strong> Mantenha um ambiente limpo e bem ventilado ao redor da planta para evitar condições favoráveis ao crescimento de fungos. Remova detritos orgânicos e evite o excesso de umidade.</li><li><strong>Monitoramento:</strong> Observe atentamente a planta para verificar se os sintomas estão melhorando. Se os problemas persistirem, considere consultar um especialista em jardinagem ou um viveiro local para obter orientação adicional.</li></ol><p>Seguindo essas orientações e fornecendo atenção cuidadosa à planta, você poderá ajudá-la a se recuperar e a florescer novamente em seu ambiente doméstico.</p>"
    },
    "Apple-Cedar apple rust": {
        "disease": "Ferrugem do Cedro-Maçã",
        "treatment": "<p>Cedar apple rust, conhecida como ferrugem do cedro da macieira, é uma doença que afeta árvores frutíferas e pode se manifestar como manchas amarelas ou laranjas nas folhas, prejudicando o crescimento e a produção de frutas. Para tratar essa doença, é importante tomar algumas medidas preventivas, como manter o ambiente ao redor das plantas limpo e livre de detritos, podar galhos infectados e manter a boa circulação de ar. Além disso, a aplicação de um fungicida adequado pode ajudar a controlar a propagação da doença.</p><p>Em relação a deficiências de nutrientes, é essencial garantir que as plantas recebam uma alimentação equilibrada. Isso inclui fornecer nutrientes essenciais, como nitrogênio, fósforo e potássio, por meio de adubos específicos. Além disso, é importante monitorar o pH do solo e corrigir quaisquer desequilíbrios para garantir que as plantas possam absorver os nutrientes de forma eficiente. Manter as plantas bem regadas e expostas à luz solar adequada também é fundamental para promover um crescimento saudável.</p>"
    },
    "Apple-healthy": {},
    "Blueberry-healthy": {},
    "Cherry (including sour)-Powdery mildew": {
        "disease": "Oídio",
        "treatment": "<p>A doença do oídio, ou míldio pulverulento, é uma condição que pode afetar as plantas de casa. Ela é caracterizada pelo aparecimento de um pó branco nas folhas, caules e brotos das plantas, o que pode tornar as folhas amareladas e diminuir o crescimento saudável da planta. Para tratar a doença do oídio, é importante:</p><ul><li><strong>1. Isolamento:</strong> Remova as plantas afetadas do convívio com outras para evitar a propagação da doença.</li><li><strong>2. Limpeza:</strong> Limpe as folhas e caules afetados com um pano úmido para remover o pó branco.</li><li><strong>3. Ventilação:</strong> Aumente a circulação de ar ao redor das plantas para reduzir a umidade, que é propícia para o crescimento do oídio.</li><li><strong>4. Tratamento natural:</strong> Pulverize as plantas com uma solução de água e bicarbonato de sódio para controlar o oídio.</li></ul><p>Quando as plantas apresentam sintomas de deficiência de nutrientes, como folhas amareladas, é importante fornecer a elas os nutrientes necessários para promover um crescimento saudável. Para corrigir deficiências de nutrientes, é recomendado:</p><ul><li><strong>1. Fertilizante:</strong> Aplique um fertilizante equilibrado rico em nitrogênio, fósforo e potássio para suprir as necessidades da planta.</li><li><strong>2. Rega adequada:</strong> Regue as plantas de forma consistente e adequada para garantir a absorção adequada dos nutrientes.</li><li><strong>3. Análise do solo:</strong> Realize uma análise do solo para identificar quais nutrientes estão em falta e ajuste a fertilização de acordo.</li><li><strong>4. Podar folhas afetadas:</strong> Remova as folhas amareladas ou danificadas para promover o crescimento de novas folhas saudáveis.</li></ul>"
    },
    "Cherry (including sour)-healthy": {},
    "Corn (maize)-Cercospora leaf spot Gray leaf spot": {
        "disease": "Mancha foliar de Cercospora / Mancha cinzenta",
        "treatment": "<p>Olá! Se a sua planta de casa está sofrendo de mancha foliar de Cercospora ou manchas cinzas nas folhas, isso pode ser devido a uma deficiência de nutrientes. Quando as plantas não recebem os nutrientes de que precisam, elas podem desenvolver manchas escuras nas folhas, fazendo com que pareçam desbotadas e doentes.</p><p>Para tratar desse problema, é importante garantir que sua planta esteja recebendo todos os nutrientes essenciais de que necessita. Certifique-se de que está regando sua planta regularmente, mas evite encharcar o solo. Além disso, considere usar um fertilizante equilibrado para fornecer os nutrientes necessários.</p><p>Além disso, certifique-se de que a planta esteja recebendo luz solar adequada e está em um ambiente com boa circulação de ar. Remova quaisquer folhas afetadas para prevenir a propagação da doença e mantenha a área ao redor da planta limpa e livre de detritos.</p><p>Ao seguir essas dicas simples, você pode ajudar a garantir que sua planta cresça saudável e feliz, e livre de manchas desagradáveis nas folhas!</p>"
    },
    "Corn (maize)-Common rust ": {
        "disease": "Ferrugem comum",
        "treatment": "<p>Quando uma planta é afetada por ferrugem comum, ela pode apresentar manchas de cor laranja ou vermelha nas folhas, juntamente com deformações e enfraquecimento. Isso pode ser causado pela deficiência de nutrientes, como o ferro. Para tratar essa deficiência, você pode fornecer à planta um fertilizante balanceado que contenha micronutrientes, como ferro, ou adicionar um suplemento de ferro ao solo, conforme as instruções do fabricante. Além disso, é importante garantir que a planta esteja recebendo água suficiente e que o pH do solo esteja adequado para a absorção de nutrientes. Observar as instruções de cuidado e manutenção da planta também é crucial para garantir que ela se recupere e permaneça saudável.</p>"
    },
    "Corn (maize)-Northern Leaf Blight": {
        "disease": "Mancha Norte da Folha",
        "treatment": "<p>Quando as plantas apresentam sintomas semelhantes à mancha foliar do norte ou deficiência de nutrientes, é importante agir rapidamente para ajudar a restaurar a saúde da planta. Aqui estão alguns passos simples que você pode seguir para tratar esses sintomas:</p><ol><li><strong>Identificar o problema:</strong> Observe atentamente as folhas afetadas e procure por manchas escuras ou amareladas, que podem indicar a presença de mancha foliar do norte, ou sinais de deficiência de nutrientes, como folhas amareladas, frágeis ou com bordas marrons.</li><li><strong>Corrigir a rega:</strong> Certifique-se de que a planta está sendo regada corretamente, evitando tanto a falta quanto o excesso de água. Regue a planta quando o solo estiver seco ao toque, mas evite encharcamento.</li><li><strong>Fornecer nutrientes:</strong> Se suspeitar de deficiência de nutrientes, considere adicionar um fertilizante balanceado específico para plantas domésticas, seguindo as instruções do rótulo cuidadosamente.</li><li><strong>Isolar plantas doentes:</strong> Se a mancha foliar do norte estiver presente, isole as plantas doentes para evitar a propagação da doença para outras plantas.</li><li><strong>Manter a higiene:</strong> Remova as folhas afetadas e mantenha a planta e suas proximidades limpas para reduzir o risco de infecções por fungos ou propagação de doenças.</li></ol><p>Seguindo estes passos e fornecendo o cuidado adequado, você pode ajudar suas plantas a se recuperarem dos sintomas de mancha foliar do norte ou deficiência de nutrientes, promovendo um crescimento saudável e bonitas folhagens.</p>"
    },
    "Corn (maize)-healthy": {},
    "Grape-Black rot": {
        "disease": "Podridão negra",
        "treatment": "<p>Se a sua planta doméstica está apresentando sintomas de podridão negra ou deficiência de nutrientes, é importante agir rapidamente para ajudar a planta a se recuperar. A podridão negra é uma doença fúngica que pode causar manchas escuras nas folhas e frutos, levando eventualmente à decomposição de todo o vegetal. Para tratar essa condição, comece removendo as folhas e frutos afetados e descartando-os em um saco de lixo bem fechado para evitar a propagação do fungo. Certifique-se de fornecer à planta as condições ideais de crescimento, incluindo rega adequada, solo bem drenado e boa circulação de ar. Além disso, considere a fertilização com um adubo balanceado para corrigir possíveis deficiências de nutrientes que possam estar contribuindo para os sintomas observados. Com um cuidado atento e paciência, sua planta tem grandes chances de se recuperar e voltar a prosperar em seu lar.</p>"
    },
    "Grape-Esca (Black Measles)": {
        "disease": "Esca (Black Measles)",
        "treatment": "<p>A doença Esca, também conhecida como Míldio Negro, é uma doença que afeta principalmente videiras, causando sintomas como manchas escuras nas folhas, morte de brotos e descoloração dos cachos de uva. Essa doença é causada por fungos e pode ser agravada por deficiências de nutrientes nas plantas.</p><p>Para tratar os sintomas da Esca ou deficiências de nutrientes em plantas de casa, é importante adotar algumas medidas. Primeiramente, é essencial fornecer à planta um solo bem drenado e livre de doenças. Além disso, a correção das deficiências nutricionais pode ser feita por meio da adição de fertilizantes específicos, como aqueles ricos em nitrogênio, potássio e fósforo.</p><p>Outra maneira de tratar as deficiências nutricionais é por meio da aplicação de micronutrientes, tais como ferro, zinco e magnésio, que podem ser fornecidos por meio de fertilizantes balanceados. Além disso, é fundamental garantir que a planta receba a quantidade adequada de água e luz solar, pois isso também pode afetar a absorção de nutrientes.</p><p>Manter a planta saudável, livre de pragas e doenças, e fornecer um ambiente propício para o seu crescimento contribuirá para prevenir e tratar efetivamente os sintomas da Esca e outras deficiências nutricionais.</p>"
    },
    "Grape-Leaf blight (Isariopsis Leaf Spot)": {
        "disease": "Mancha foliar (Mancha foliar de Isariopsis)",
        "treatment": "<p>Se a sua planta doméstica está mostrando sinais de manchas foliares ou deficiência de nutrientes, é importante tomar medidas para tratá-la. Se a doença for manchas nas folhas causadas por Isariopsis Leaf Spot, você pode tentar o seguinte tratamento:</p><ol><li>Retire as folhas afetadas e descarte-as para evitar a propagação da doença.</li><li>Aplique um fungicida aprovado para uso em plantas domésticas, seguindo as instruções do rótulo.</li><li>Mantenha a planta em um local arejado e com boa circulação de ar, para diminuir a umidade que favorece o desenvolvimento da doença.</li><li>Evite regar as folhas da planta, concentrando a água diretamente no solo.</li></ol><p>Se os sintomas forem de deficiência de nutrientes, você pode tentar o seguinte tratamento:</p><ol><li>Identifique os nutrientes em falta observando os sintomas nas folhas e pesquisando sobre os sintomas de deficiência de nutrientes específicos.</li><li>Forneça um fertilizante balanceado específico para plantas domésticas, que atenda às necessidades da planta afetada.</li><li>Siga as instruções de aplicação do fertilizante e monitore a planta para garantir que os sintomas de deficiência diminuam.</li><li>Mantenha um cronograma regular de adubação e certifique-se de que a planta esteja recebendo os nutrientes necessários para um crescimento saudável.</li></ol>"
    },
    "Grape-healthy": {},
    "Orange-Haunglongbing (Citrus greening)": {
        "disease": "Huanglongbing (Citrus greening)",
        "treatment": "<p>Haunglongbing, também conhecida como greening dos citros, é uma doença altamente prejudicial para as plantas cítricas. Os sintomas incluem folhas amareladas, frutas deformadas e amargas, e declínio geral da saúde da planta. Além disso, deficiências de nutrientes também podem causar sintomas semelhantes, como folhas amareladas, crescimento fraco e diminuição da produção de frutas.</p><p>Para tratar os sintomas de Haunglongbing ou deficiência de nutrientes em plantas cítricas, primeiro é importante identificar os nutrientes em falta. Pode-se realizar testes de solo ou folhagem para determinar quais nutrientes estão em falta. Depois de identificar a deficiência, recomenda-se aplicar fertilizantes ricos nos nutrientes necessários.</p><p>Além disso, é importante garantir que a planta esteja recebendo água adequadamente. Regar a planta regularmente e de acordo com as necessidades da espécie de cítrico é essencial para promover a absorção de nutrientes.</p><p>Outra prática importante é a poda adequada das plantas. Remover galhos doentes, danificados ou mortos ajudará a promover o crescimento saudável das plantas. Além disso, a adição de matéria orgânica ao solo pode melhorar a saúde e a nutrientes das plantas.</p><p>Manter as plantas saudáveis e livres de pragas também é crucial para prevenir e tratar sintomas de Haunglongbing e deficiências de nutrientes. Monitorar regularmente as plantas, inspecionar folhas e frutas em busca de sinais de doenças ou deficiências e tomar medidas preventivas, como a aplicação de pesticidas naturais, pode ser benéfico.</p>"
    },
    "Peach-Bacterial spot": {
        "disease": "Mancha bacteriana",
        "treatment": "<p>A doença conhecida como mancha bacteriana é uma doença causada por bactérias que afeta plantas de casa, como tomate, pimentão e outras plantas cultivadas. Os sintomas incluem manchas escuras nas folhas, com um halo amarelo ao redor e podem se estender às hastes e frutos. Essa doença pode ser confundida com sintomas de deficiência de nutrientes, como ocorrência de manchas em folhas.</p><p>Para tratar a mancha bacteriana ou sintomas semelhantes de deficiência de nutrientes, comece removendo as folhas infectadas e mantenha a planta limpa e bem ventilada. Evite molhar as folhas diretamente, pois a umidade pode promover o crescimento das bactérias. Certifique-se de fornecer à planta um bom equilíbrio de nutrientes, especialmente nitrogênio, fósforo e potássio, para garantir seu crescimento saudável. Além disso, pode ser útil aplicar um fertilizante balanceado ou orgânico para corrigir quaisquer deficiências de nutrientes e fortalecer a planta.</p>"
    },
    "Peach-healthy": {},
    "Pepper, bell-Bacterial spot": {
        "disease": "Mancha bacteriana",
        "treatment": "<p> A doença da mancha bacteriana é causada pela bactéria Xanthomonas campestris e causa manchas escuras nas folhas das plantas. Os sintomas incluem lesões escuras, murcha das folhas e queda prematura das folhas. É importante tomar medidas para evitar a propagação da doença, incluindo a remoção e destruição das folhas afetadas e a utilização de métodos de prevenção, como a rotação de culturas.</p><p>Em relação à deficiência de nutrientes, é fundamental identificar o nutriente específico em falta. A falta de nitrogênio pode causar folhas amareladas, enquanto a falta de ferro pode resultar em folhas com manchas amareladas entre as nervuras. A adição de fertilizantes ou compostos ricos nos nutrientes necessários pode ajudar a corrigir a deficiência. Além disso, garantir que a planta esteja recebendo a quantidade adequada de água e luz solar também é essencial para manter a saúde das plantas.</p>"
    },
    "Pepper, bell-healthy": {},
    "Potato-Early blight": {
        "disease": "Mancha foliar precoce",
        "treatment": "<p>Early Blight, ou murcha de Alternaria, é uma doença causada por fungos que afeta as plantas. Os sintomas incluem manchas escuras nas folhas, que eventualmente se espalham e causam o murchamento das folhas e caules. Além disso, as plantas podem apresentar deficiência de nutrientes, impactando seu crescimento e desenvolvimento.</p><p>Para tratar os sintomas de Early Blight e deficiências de nutrientes em plantas, é importante tomar algumas medidas. Primeiramente, certifique-se de fornecer água adequadamente às plantas, evitando o encharcamento do solo. Além disso, é essencial garantir que as plantas recebam a quantidade adequada de nutrientes, como nitrogênio, fósforo e potássio, por meio de adubação equilibrada.</p><p>Além disso, é recomendável realizar a poda das partes afetadas das plantas para evitar a propagação da doença e permitir que a energia da planta seja direcionada para as partes saudáveis. O uso de fungicidas e pesticidas apropriados também pode ajudar a controlar a infestação fúngica.</p><p>Ao implementar essas práticas de cuidados com as plantas, é possível promover a saúde e o vigor das plantas, ajudando-as a superar os sintomas de Early Blight e deficiências de nutrientes.</p>"
    },
    "Potato-Late blight": {
        "disease": "Míldio",
        "treatment": "<p>Quando a planta está infectada com o fungo da doença 'míldio tardio' ou exibe sintomas de nutrientes deficientes, como folhas amareladas ou manchas escuras, é importante agir rapidamente para ajudar a planta a se recuperar. Primeiramente, é importante garantir que a planta receba a quantidade adequada de água e luz solar. Além disso, é recomendado aplicar um fungicida apropriado para combater o míldio tardio, seguindo as instruções do fabricante. Para corrigir deficiências de nutrientes, é aconselhável adicionar um fertilizante balanceado de acordo com as necessidades da planta, como um fertilizante NPK. Certifique-se de não sobrealimentar a planta e de seguir as instruções de dosagem. Monitorar regularmente a saúde da planta é essencial para garantir que as medidas corretivas estejam surtindo efeito, e que a planta possa se recuperar completamente.</p>"
    },
    "Potato-healthy": {},
    "Raspberry-healthy": {},
    "Soybean-healthy": {},
    "Squash-Powdery mildew": {
        "disease": "Oídio",
        "treatment": "<p>Quando sua planta de casa é afetada pelo míldio em pó, ela pode parecer coberta por uma camada de pó branco. Este é um fungo que se espalha e se alimenta da planta. Para tratar isso, você pode começar removendo suavemente a camada de pó com um pano úmido. Certifique-se de não danificar as folhas ao fazer isso. Em seguida, é importante garantir que a planta receba boa circulação de ar e luz solar adequada. Evite regar a planta por cima, pois a umidade excessiva pode promover o crescimento do míldio. Em vez disso, regue diretamente no solo e certifique-se de que a planta tenha um bom sistema de drenagem. Além disso, você pode aplicar um fungicida específico para o míldio em pó, seguindo as instruções do produto. Certifique-se também de manter a planta saudável, fornecendo os nutrientes necessários, como nitrogênio, potássio e fósforo, que podem ser encontrados em fertilizantes específicos para plantas de casa. Fique atento a sinais de deficiência de nutrientes, como folhas amareladas ou manchas, e ajuste a fertilização adequadamente. Com esses cuidados, sua planta pode se recuperar e prosperar novamente.</p>"
    },
    "Strawberry-Leaf scorch": {
        "disease": "Queima foliar",
        "treatment": "<p>Se as folhas da sua planta estão apresentando sintomas de queima, como bordas marrons e secas, isso pode ser um sinal de escaldadura ou deficiência de nutrientes. A escaldadura é causada por uma exposição excessiva ao sol, enquanto as deficiências de nutrientes, como nitrogênio, potássio ou magnésio, podem levar a sintomas semelhantes.</p><p>Para tratar a escaldadura, você pode mover a planta para um local com mais sombra e proteção do sol direto. Certifique-se de regar a planta regularmente para ajudar na recuperação e evitar mais estresse hídrico. Além disso, remova as folhas danificadas para promover o crescimento saudável de novas folhas.</p><p>No caso de deficiências de nutrientes, é importante fornecer à planta um fertilizante equilibrado que contenha os nutrientes necessários. Siga as instruções de aplicação do fertilizante e regue a planta conforme necessário. Além disso, pode ser útil adicionar matéria orgânica ao solo para melhorar a absorção de nutrientes.</p><p>A monitorização regular das condições de luz, rega e fertilização da planta pode ajudar a prevenir a recorrência desses problemas e manter suas plantas saudáveis e felizes.</p>"
    },
    "Strawberry-healthy": {},
    "Tomato-Bacterial spot": {
        "disease": "Mancha bacteriana",
        "treatment": "<p>Se a sua planta doméstica está exibindo manchas escuras e apodrecidas nas folhas, ela pode estar sofrendo de uma doença chamada 'Mancha Bacteriana'. Essa doença é causada por bactérias que se desenvolvem em condições de umidade e calor elevados, e se manifesta através de manchas escuras e encharcadas nas folhas da planta. As plantas afetadas também podem apresentar deficiências nutricionais que podem se manifestar de maneira semelhante, com folhas amareladas, manchas marrons e descoloração.</p><p>Para tratar esses sintomas, comece por remover as folhas afetadas e garantir que a planta esteja recebendo a quantidade adequada de luz solar e água. Certifique-se de não molhar as folhas, pois a umidade excessiva pode contribuir para o desenvolvimento de doenças. Além disso, verifique se a planta está recebendo os nutrientes necessários, como nitrogênio, fósforo e potássio, que são essenciais para o crescimento saudável. Você pode aplicar um fertilizante balanceado conforme as instruções do fabricante para ajudar a corrigir deficiências nutricionais.</p><p>É importante manter um ambiente limpo ao redor da planta e evitar o acúmulo de folhas caídas ou detritos, pois isso pode abrigar bactérias e fungos. Se a infecção persistir, considere a aplicação de um fungicida ou bactericida adequado, seguindo as orientações de uso.</p>"
    },
    "Tomato-Early blight": {
        "disease": "Murcha precoce",
        "treatment": "<p>Early blight, também conhecida como mancha foliar, é uma doença fúngica comum em plantas de casa, caracterizada por manchas escuras nas folhas, que podem se espalhar para o caule e frutas. Além disso, deficiências nutricionais também podem se manifestar em sintomas como folhas amareladas, manchas nas folhas ou crescimento retardado.</p><p>Para tratar a doença Early blight ou sintomas semelhantes de deficiência de nutrientes, é importante seguir algumas práticas simples. Primeiramente, deve-se remover as partes afetadas da planta com cuidado, certificando-se de não espalhar o fungo para outras áreas. Em seguida, é essencial fornecer a planta com os nutrientes adequados para fortalecer seu sistema imunológico e acelerar a recuperação.</p><p>Uma maneira divertida de ajudar a planta a se recuperar é através de uma 'comida especial' feita com cascas de legumes e frutas, que podem ser transformadas em adubo orgânico. Também é importante garantir que a planta receba a quantidade certa de água e luz solar, pois esses são fatores essenciais para a saúde das plantas. Além disso, pode-se aplicar uma cobertura morta ao redor da planta para ajudar a reter a umidade e proteger contra novas infecções.</p><p>Seguindo essas etapas simples, e dando muito carinho e atenção à sua planta, é possível ajudá-la a se recuperar da doença Early blight e de deficiências nutricionais, garantindo que continue a crescer e florescer em seu lar.</p>"
    },
    "Tomato-Late blight": {
        "disease": "Mancha Parda",
        "treatment": "<p>A doença conhecida como ‘míldio tardio’ é causada por um fungo chamado Phytophthora infestans e afeta principalmente plantas de batata e tomate. Os sintomas incluem manchas escuras e úmidas nas folhas, que eventualmente se espalham para os frutos, causando apodrecimento.</p><p>Se sua planta apresenta sintomas semelhantes, pode ser necessário verificar se a doença é realmente o míldio tardio ou se é um problema relacionado à deficiência de nutrientes. As deficiências de nutrientes podem se manifestar de forma diferente, como folhas amareladas, manchas de cor diferente, ou crescimento atrasado.</p><p>Para tratar o míldio tardio, é importante remover e destruir as folhas e frutos afetados, garantir uma boa circulação de ar ao redor da planta, e aplicar fungicidas apropriados conforme as instruções do fabricante. Além disso, é importante manter a umidade do solo controlada, regando a planta na base e evitando molhar as folhas para reduzir a proliferação do fungo.</p><p>No caso de deficiências de nutrientes, é importante identificar quais nutrientes a planta está precisando, seja através de testes de solo ou observando os sintomas, e então fornecer fertilizantes balanceados. Por exemplo, se as folhas estiverem amareladas, pode ser indicativo de deficiência de nitrogênio, então um fertilizante rico em nitrogênio pode ser aplicado.</p><p>Como em qualquer tratamento para problemas de plantas, é fundamental observar atentamente a planta, tomar as medidas apropriadas de manejo e cuidado, e buscar aconselhamento profissional se necessário. Com paciência, cuidado e atenção, é possível reverter os sintomas e garantir uma planta saudável.</p>"
    },
    "Tomato-Leaf Mold": {
        "disease": "Mofo foliar",
        "treatment": "<p>A doença do mofo das folhas, ou mildio, é causada por um fungo que deixa manchas amarelas nas folhas das plantas. Se sua planta possui manchas amarelas ou áreas marrons nas folhas, pode ser um sinal de deficiência de nutrientes. Para tratar esta condição, você precisará:</p><ol><li>1. Regar a planta de maneira adequada, evitando o excesso de umidade que promove o crescimento de fungos;</li><li>2. Utilizar um fertilizante balanceado para repor os nutrientes necessários;</li><li>3. Certificar-se de que a planta esteja recebendo a quantidade certa de luz solar;</li></ol><p>Lembre-se de observar a planta regularmente e manter um cuidado constante para ajudá-la a se recuperar. Com esses cuidados, sua planta estará mais saudável e resistente a doenças e deficiências de nutrientes.</p>"
    },
    "Tomato-Septoria leaf spot": {
        "disease": "Mancha foliar de septoria",
        "treatment": "<p>Septoria leaf spot é uma doença comum que afeta muitas plantas de interior, apresentando manchas escuras nas folhas. Esta doença é causada por um fungo e pode enfraquecer a planta se não for tratada adequadamente.</p><p>Em casos de deficiência de nutrientes, as plantas podem apresentar uma variedade de sintomas, como folhas amareladas, manchas nas folhas, crescimento fraco, entre outros sinais.</p><p>Para tratar a Septoria leaf spot ou sintomas semelhantes de deficiência de nutrientes em plantas de interior, siga as seguintes orientações:</p><ol><li><strong>Remova as folhas afetadas:</strong> Retire as folhas que apresentam manchas escuras para evitar a propagação da doença.</li><li><strong>Aumente a circulação de ar:</strong> Coloque a planta em um local com boa circulação de ar para reduzir a umidade, que pode favorecer o crescimento do fungo.</li><li><strong>Regue com cuidado:</strong> Evite molhar as folhas e regue a planta na base para evitar o acúmulo de umidade nas folhas, o que pode favorecer o desenvolvimento de doenças fúngicas.</li><li><strong>Fornecer nutrientes adequados:</strong> Utilize um adubo equilibrado ou específico para as necessidades da planta, seguindo as instruções do fabricante.</li><li><strong>Monitoramento:</strong> Observe regularmente a planta para detectar novos sintomas e agir rapidamente caso a doença ou deficiência persista.</li></ol><p>Seguindo essas orientações, você pode ajudar a sua planta a se recuperar da Septoria leaf spot ou de sintomas de deficiência de nutrientes, garantindo um ambiente saudável para seu crescimento.</p>"
    },
    "Tomato-Spider mites Two-spotted spider mite": {
        "disease": "Ácaros rajados",
        "treatment": "<p>A doença dos &#39;Ácaros de aranha&#39; ou sintomas semelhantes de deficiência de nutrientes em plantas é um problema comum que ocorre quando a planta é atacada por ácaros. Os ácaros de aranha fazem com que as folhas das plantas fiquem amarelas e com manchas, e eventualmente as folhas podem cair. Além disso, a planta pode exibir sintomas de deficiência de nutrientes, como amarelamento das folhas e crescimento prejudicado.</p><p>Para tratar a infestação de ácaros de aranha e prevenir possíveis deficiências de nutrientes, siga estas etapas simples:</p><ol><li><p><strong>Isolar a planta:</strong> Se a planta estiver infestada, isole-a das outras plantas para evitar a propagação da infestação.</p></li><li><p><strong>Limpeza das folhas:</strong> Limpe as folhas afetadas com um pano úmido para remover os ácaros e seus ovos.</p></li><li><p><strong>Regar corretamente:</strong> Mantenha a planta bem regada para ajudar a combater a infestação e garantir que as raízes tenham acesso aos nutrientes necessários.</p></li><li><p><strong>Aplicar fertilizante:</strong> Se a planta estiver exibindo sintomas de deficiência de nutrientes, aplique um fertilizante balanceado de acordo com as instruções do fabricante.</p></li><li><p><strong>Monitoramento constante:</strong> Fique atento ao desenvolvimento da planta e continue a monitorar a presença de ácaros de aranha. Repita a limpeza das folhas e a aplicação de fertilizantes, conforme necessário.</p></li></ol>"
    },
    "Tomato-Target Spot": {
        "disease": "Mancha Alvo",
        "treatment": "<p>A mancha-alvo, ou Mancha-alvo Foliar, é uma doença que ocorre em muitas plantas de casa, resultando em pequenas manchas circulares nas folhas. Estas manchas podem variar de cor e tamanho, e são frequentemente um sinal de deficiência de nutrientes na planta.</p><p>Para tratar as manchas circulares nas folhas, é importante identificar a causa subjacente. Se for uma deficiência de nutrientes, é crucial fornecer à planta os nutrientes necessários. Você pode começar fertilizando a planta com um fertilizante balanceado para fornecer os nutrientes em falta. Certifique-se de seguir as instruções de fertilização para a sua planta específica.</p><p>Além disso, é importante garantir que a planta esteja recebendo a quantidade adequada de luz solar e água. Manter um cronograma consistente de rega e garantir que a planta esteja recebendo a quantidade certa de luz pode ajudar a promover o crescimento saudável das folhas e a prevenir futuras deficiências de nutrientes.</p><p>A manutenção regular da planta, como limpeza das folhas e a remoção de quaisquer detritos, também pode ajudar a prevenir problemas futuros. Fique atento às mudanças nas condições da planta e ajuste o cuidado conforme necessário para promover a saúde e o vigor da mesma.</p>"
    },
    "Tomato-Tomato Yellow Leaf Curl Virus": {
        "disease": "Vírus do Enrolamento das Folhas Amarelas",
        "treatment": "<p>O vírus do enrolamento amarelo das folhas é uma doença que afeta muitas plantas de interior, causando sintomas como folhas amareladas, enroladas e com manchas.</p><p>Para tratar os sintomas do vírus do enrolamento amarelo das folhas ou deficiência de nutrientes, é importante fornecer um cuidado adequado à planta. Primeiramente, remova as folhas amareladas e doentes para prevenir a propagação do vírus. Em seguida, certifique-se de que a planta esteja recebendo a quantidade adequada de água, luz solar e nutrientes essenciais.</p><p>Para corrigir deficiências nutricionais, você pode considerar a adição de fertilizantes balanceados de acordo com as necessidades da planta. Certifique-se de seguir as instruções de dosagem e aplicação do fertilizante para evitar danos à planta.</p><p>Além disso, garantir que a planta esteja em um ambiente livre de estresse, com boa ventilação e sem mudanças bruscas de temperatura pode ajudar a promover a saúde e a recuperação da planta afetada pelo vírus do enrolamento amarelo das folhas ou deficiência de nutrientes.</p>"
    },
    "Tomato-Tomato mosaic virus": {
        "disease": "vírus do mosaico",
        "treatment": "<p>Quando a planta apresenta sintomas devido ao vírus do mosaico ou deficiência de nutrientes, é importante tomar medidas para curar a planta e impedir que a condição se agrave. Primeiramente, é fundamental isolar a planta afetada para evitar a propagação do vírus para outras plantas. Certifique-se de retirar quaisquer plantas doentes ou infectadas nas imediações.</p><p>Para ajudar a tratar a planta, é essencial verificar as condições de crescimento, como a quantidade de luz solar que a planta recebe e a umidade do solo. Certifique-se de que a planta esteja recebendo a quantidade adequada de água e que o solo tenha boa drenagem. Além disso, considerar a adubação adequada é essencial para garantir que a planta receba os nutrientes necessários para se recuperar.</p> <p>Se a planta estiver sofrendo de deficiência de nutrientes, pode ser útil adicionar um fertilizante balanceado de acordo com as instruções de dosagem recomendadas. Também é aconselhável monitorar de perto a planta para verificar a melhora dos sintomas e ajustar o tratamento conforme necessário.</p>"
    },
    "Tomato-healthy": {}
}