{
    "Apple-Apple scab": {
        "disease": "scab",
        "treatment": "A sarna é uma doença fúngica que afeta muitas plantas, causando manchas escuras e elevadas nas folhas, frutas e caules. Para tratar a sarna, é recomendado remover e destruir as partes afetadas da planta, aplicar um fungicida apropriado e manter a planta bem ventilada para reduzir a umidade. Além disso, é importante evitar molhar as folhas durante a rega e fornecer boa drenagem no solo para prevenir o desenvolvimento da doença."
    },
    "Apple-Black rot": {
        "disease": "Podridão negra",
        "treatment": "A doença da podridão negra pode ser tratada através da remoção e destruição das plantas afetadas, da aplicação de fungicidas apropriados e da adoção de práticas de prevenção, como a rotação de culturas e a eliminação de restos de cultura infectados."
    },
    "Apple-Cedar apple rust": {
        "disease": "Ferrugem do Cedro-Maçã",
        "treatment": "A ferrugem do cedro-maçã pode ser tratada por meio da aplicação de fungicidas específicos. É importante também realizar a poda de galhos infectados e a remoção de folhas caídas para reduzir a propagação da doença. Mantenha a planta em boas condições de crescimento, fornecendo uma adequada nutrição e rega, para fortalecer sua resistência à doença."
    },
    "Apple-healthy": {},
    "Blueberry-healthy": {},
    "Cherry (including sour)-Powdery mildew": {
        "disease": "Oídio",
        "treatment": "O oídio pode ser tratado com a aplicação de fungicidas específicos, como enxofre, ou com a poda e remoção das partes da planta afetadas. Também é importante manter a planta em um ambiente com boa circulação de ar e evitar molhar as folhas durante a rega."
    },
    "Cherry (including sour)-healthy": {},
    "Corn (maize)-Cercospora leaf spot Gray leaf spot": {
        "disease": "Mancha foliar de Cercospora / Mancha cinzenta",
        "treatment": "Para tratar a mancha foliar de Cercospora / mancha cinzenta, é recomendado realizar pulverizações com fungicidas específicos, seguindo as instruções de dosagem e aplicação fornecidas pelo fabricante. Também é importante manejar adequadamente a irrigação e evitar o excesso de umidade nas folhas, além de remover e destruir as folhas infectadas para reduzir a disseminação da doença."
    },
    "Corn (maize)-Common rust ": {
        "disease": "Ferrugem comum",
        "treatment": "A ferrugem comum pode ser tratada com fungicidas apropriados, como o mancozebe ou o tebuconazol. Além disso, é importante realizar a poda e remoção das partes afetadas da planta, manter a área ao redor da planta limpa e arejada, e evitar molhar as folhas durante a rega para reduzir a umidade e prevenir a propagação da doença."
    },
    "Corn (maize)-Northern Leaf Blight": {
        "disease": "Mancha Norte da Folha",
        "treatment": "Para tratar a Mancha Norte da Folha, remova e destrua as folhas afetadas. Utilize fungicidas apropriados e faça rotação de culturas. Mantenha a plantação limpa e evite o excesso de umidade."
    },
    "Corn (maize)-healthy": {},
    "Grape-Black rot": {
        "disease": "Podridão negra",
        "treatment": "A podridão negra pode ser tratada com a poda e remoção das partes afetadas da planta, além do uso de fungicidas apropriados. É importante também manter a planta em boas condições de nutrição e irrigação para fortalecer sua resistência às doenças."
    },
    "Grape-Esca (Black Measles)": {
        "disease": "Esca (Black Measles)",
        "treatment": "Esca (ou Black Measles) é uma doença que afeta as videiras, causada por fungos. O tratamento recomendado inclui a poda correta das plantas afetadas, a aplicação de fungicidas apropriados e a promoção de práticas culturais que fortaleçam a saúde das videiras, como a adubação equilibrada e o manejo adequado da irrigação."
    },
    "Grape-Leaf blight (Isariopsis Leaf Spot)": {
        "disease": "Mancha foliar (Mancha foliar de Isariopsis)",
        "treatment": "A mancha foliar, também conhecida como mancha foliar de Isariopsis, pode ser tratada com a aplicação de fungicidas aprovados para o controle desse tipo de doença. Além disso, é importante manter a higiene da plantação, removendo e destruindo as folhas infectadas, e realizar a rotação de culturas para reduzir a incidência da doença."
    },
    "Grape-healthy": {},
    "Orange-Haunglongbing (Citrus greening)": {
        "disease": "Huanglongbing (Citrus greening)",
        "treatment": "O Huanglongbing, também conhecido como greening dos citrus, é uma doença causada por uma bactéria que afeta as laranjeiras e outros citros. Para tratar essa doença, é importante implementar práticas de manejo integrado, como a eliminação de plantas doentes, o controle de insetos vetores, o uso de mudas sadias e a aplicação de fertilizantes equilibrados. Além disso, a adoção de medidas de controle químico e o monitoramento constante da plantação são fundamentais para o gerenciamento eficaz do Huanglongbing."
    },
    "Peach-Bacterial spot": {
        "disease": "Mancha bacteriana",
        "treatment": "Para tratar a mancha bacteriana, é recomendado o uso de fungicidas bactericidas e a prática de rotação de culturas. Além disso, é importante realizar a poda das folhas infectadas e manter a boa ventilação na plantação para reduzir a umidade, que favorece a proliferação da doença."
    },
    "Peach-healthy": {},
    "Pepper, bell-Bacterial spot": {
        "disease": "Mancha bacteriana",
        "treatment": "Para tratar a mancha bacteriana, remova as folhas afetadas e use um fungicida bacteriano recomendado. Certifique-se de seguir as instruções do fabricante para garantir um tratamento eficaz."
    },
    "Pepper, bell-healthy": {},
    "Potato-Early blight": {
        "disease": "Mancha foliar precoce",
        "treatment": "Para tratar a mancha foliar precoce, é importante realizar uma rotação de culturas, aplicar fungicidas específicos e manejar cuidadosamente a irrigação para evitar o excesso de umidade."
    },
    "Potato-Late blight": {
        "disease": "Míldio",
        "treatment": "O tratamento para o míldio consiste na aplicação de fungicidas cúpricos ou à base de mancozebe. Além disso, é importante fazer a rotação de culturas e evitar o excesso de umidade no solo."
    },
    "Potato-healthy": {},
    "Raspberry-healthy": {},
    "Soybean-healthy": {},
    "Squash-Powdery mildew": {
        "disease": "Oídio",
        "treatment": "O oídio pode ser tratado com a aplicação de fungicidas específicos, como enxofre, bicarbonato de sódio, óleo de neem ou produtos à base de enxofre. Além disso, é importante manter a planta bem ventilada, evitar o excesso de umidade, e retirar e destruir as partes infectadas da planta."
    },
    "Strawberry-Leaf scorch": {
        "disease": "Queima foliar",
        "treatment": "A queima foliar pode ser tratada através da poda das áreas afetadas, da regulação da irrigação para evitar o estresse hídrico e da aplicação de fungicidas adequados para controlar qualquer infecção fúngica associada."
    },
    "Strawberry-healthy": {},
    "Tomato-Bacterial spot": {
        "disease": "Mancha bacteriana",
        "treatment": "Para tratar a mancha bacteriana, recomenda-se a remoção e destruição das plantas doentes, a aplicação de produtos à base de cobre e a prática de rotação de culturas."
    },
    "Tomato-Early blight": {
        "disease": "Murcha precoce",
        "treatment": "Para tratar a murcha precoce, remova e destrua as plantas doentes e mantenha uma boa ventilação para reduzir a umidade. Também é possível aplicar fungicidas apropriados de acordo com as instruções do fabricante."
    },
    "Tomato-Late blight": {
        "disease": "Mancha Parda",
        "treatment": "Para tratar a Mancha Parda, é recomendado o uso de fungicidas específicos, como o Mancozebe, aplicados de acordo com as instruções do fabricante. Além disso, é importante realizar podas para remover partes da planta afetadas, e manter a plantação livre de detritos e restos de vegetação para reduzir a propagação da doença."
    },
    "Tomato-Leaf Mold": {
        "disease": "Mofo foliar",
        "treatment": "Para tratar o mofo foliar, é recomendado remover as folhas afetadas e manter a planta em local com boa circulação de ar. Evite molhar as folhas e utilize fungicidas apropriados conforme as instruções do fabricante."
    },
    "Tomato-Septoria leaf spot": {
        "disease": "Mancha foliar de septoria",
        "treatment": "Para tratar a mancha foliar de septoria, é recomendado o uso de fungicidas, aplicação de cobre ou bicarbonato de sódio, além de práticas de manejo como a eliminação de restos de cultura infectados e rotação de culturas."
    },
    "Tomato-Spider mites Two-spotted spider mite": {
        "disease": "Ácaros rajados",
        "treatment": "Para tratar ácaros rajados, é recomendado remover as folhas e ramos afetados, aplicar óleo de nim ou inseticidas naturais, manter um ambiente úmido e usar predadores naturais como ácaros predadores ou joaninhas para controlar a infestação."
    },
    "Tomato-Target Spot": {
        "disease": "Mancha Alvo",
        "treatment": "Para tratar a Mancha Alvo, é recomendado remover e destruir as partes afetadas da planta, aplicar fungicidas apropriados e manter a planta saudável por meio de práticas de manejo adequadas, como rega e adubação adequadas, e controle da densidade populacional das plantas."
    },
    "Tomato-Tomato Yellow Leaf Curl Virus": {
        "disease": "Vírus do Enrolamento das Folhas Amarelas",
        "treatment": "O tratamento do Vírus do Enrolamento das Folhas Amarelas envolve a remoção e destruição das plantas doentes, a aplicação de inseticidas para controle dos vetores, e a implementação de medidas de controle cultural, como rotação de culturas e eliminação de plantas hospedeiras alternativas."
    },
    "Tomato-Tomato mosaic virus": {
        "disease": "vírus do mosaico",
        "treatment": "O tratamento para o vírus do mosaico inclui a remoção e descarte de plantas doentes, controle de insetos vetores, práticas de cultivo que promovam a saúde das plantas, e uso de variedades resistentes, se disponíveis."
    },
    "Tomato-healthy": {}
}